import sqlite3

conn = sqlite3.connect('company.db')
cursor = conn.cursor()

# Удаляем все записи из таблиц
cursor.execute("DELETE FROM Поручения")
cursor.execute("DELETE FROM Работа")
cursor.execute("DELETE FROM Сотрудники")

# Данные для таблицы "Сотрудники"
сотрудники_data = [
    (101, 'Иванов Иван Иванович', 'Программист'),
    (102, 'Петрова Анна Сергеевна', 'Маркетолог'),
    (103, 'Сидоров Сергей Петрович', 'Дизайнер'),
    (104, 'Козлова Елена Владимировна', 'Менеджер по продажам'),
    (105, 'Васильев Андрей Николаевич', 'Системный администратор'),
    (106, 'Смирнова Ольга Дмитриевна', 'Бухгалтер')
]

# Данные для таблицы "Работа"
работа_data = [
    (1, 'Разработка веб-сайта', 80, '2011-03-15'),
    (2, 'Проведение маркетингового исследования', 40, '2010-03-22'),
    (3, 'Создание презентации', 20, '2012-03-29'),
    (4, 'Разработка мобильного приложения', 120, '2011-04-10'),
    (5, 'Настройка серверов', 60, '2010-04-15'),
    (6, 'Проведение аудита', 30, '2012-04-20'),
    (7, 'Подготовка отчета', 10, '2011-04-25'),
    (8, 'Обновление программного обеспечения', 50, '2010-05-01'),
    (9, 'Обучение пользователей', 25, '2012-05-05'),
    (10, 'Ремонт оборудования', 45, '2011-05-10'),
    (11, 'Ведение переговоров', 15, '2010-05-15'),
    (12, 'Проведение тендера', 20, '2012-05-20')
]

# Данные для таблицы "Поручения"
поручения_data = [
    (1, '2009-04-01', 10, '2010-05-08', '2010-05-10'),
    (2, '2011-03-05', 15, '2011-04-12', '2011-03-18'),
    (3, '2012-03-10', 8, '2012-07-17', '2012-05-16'),
    (4, '2010-03-15', 20, '2010-03-22', '2010-03-23'),
    (5, '2011-03-20', 12, '2011-03-27', '2011-03-26'),
    (6, '2012-03-25', 5, '2012-04-01', '2012-03-31'),
    (7, '2010-04-01', 18, '2010-04-08', '2010-04-07'),
    (8, '2011-04-05', 10, '2011-04-12', '2011-04-11'),
    (9, '2012-04-10', 25, '2012-04-17', '2012-04-16'),
    (10, '2010-04-15', 15, '2010-04-22', '2010-04-21'),
    (11, '2011-04-20', 8, '2011-04-27', '2011-04-26'),
    (12, '2012-04-25', 12, '2012-05-02', '2012-05-01'),
    (13, '2010-05-01', 20, '2010-05-08', '2010-05-07'),
    (14, '2011-05-05', 15, '2011-05-12', '2011-05-11'),
    (15, '2012-05-10', 10, '2012-05-17', '2012-05-16')
]

# Вставка данных в таблицы
cursor.executemany("INSERT INTO Сотрудники VALUES (?, ?, ?)", сотрудники_data)
cursor.executemany("INSERT INTO Работа VALUES (?, ?, ?, ?)", работа_data)
cursor.executemany("INSERT INTO Поручения VALUES (?, ?, ?, ?, ?)", поручения_data)


conn.commit()
conn.close()